import 'package:adv_basics/models/quiz_question.dart';

const questions = [
  QuizQuestion('다음 중 원소 기호 \'Ag\'가 나타내는 금속은 무엇인가요?', [
    '은',
    '금',
    '구리',
    '철',
  ]),
  QuizQuestion('세계에서 가장 넓은 면적을 가진 국가는 어디인가요?', [
    '러시아',
    '캐나다',
    '미국',
    '중국',
  ]),
  QuizQuestion('임진왜란 당시 한산도 대첩을 승리로 이끈 장군은 누구인가요?', [
    '이순신',
    '권율',
    '김시민',
    '곽재우',
  ]),
  QuizQuestion('인류 최초로 달에 착륙한 우주비행사는 누구인가요?', [
    '닐 암스트롱',
    '유리 가가린',
    '버즈 올드린',
    '엘론 머스크',
  ]),
  QuizQuestion('태양계 행성 중 태양과 가장 가까운 행성은 무엇인가요?', [
    '수성',
    '금성',
    '화성',
    '지구',
  ]),
  QuizQuestion('르네상스 시대를 대표하며 \'모나리자\'를 그린 인물은?', [
    '레오나르도 다 빈치',
    '미켈란젤로',
    '라파엘로',
    '파블로 피카소',
  ]),
  QuizQuestion('대한민국 헌법 제1조 1항은 "대한민국은 ( )국가이다" 입니다. 빈칸은?', [
    '민주공화',
    '자유민주',
    '사회주의',
    '연방제',
  ]),
  QuizQuestion('컴퓨터의 두뇌 역할을 하는 장치의 약자는 무엇인가요?', [
    'CPU',
    'RAM',
    'HDD',
    'GPU',
  ]),
  QuizQuestion('빛의 속도(c)는 1초에 약 몇 km를 이동하나요?', [
    '약 30만 km',
    '약 15만 km',
    '약 3만 km',
    '약 100만 km',
  ]),
  QuizQuestion('노르웨이 출신의 화가로 작품 \'절규\'를 남긴 사람은 누구인가요?', [
    '에드바르 뭉크',
    '빈센트 반 고흐',
    '살바도르 달리',
    '구스타프 클림트',
  ]),
];