#include <stdio.h>
#include <stdlib.h>

int main(int argc, char* argv[]) {
    
    // 1. 비트연산 ; 2진수 연산
    int a = 60; // 0011 1100
    int b = 13; // 0000 1101
    int c;
    c = a & b;  // 0000 1100; 12
    printf("a & b : %d\n", c);
    c = a | b;  // 0011 1101; 61
    printf("a | c : %d\n", c);
    c = a ^ b;  // 0011 0001; 49
    printf("a ^ b : %d\n", c);
    c = ~a;     // 1100 0011; -61
    printf("~a : %d\n", c);

    // shift 연산은 한번씩 할 때 2배 혹은 /2
    c = a << 2; // 1111 0000; 240, 4배
    printf("a << 2 : %d\n",c);
    c = a >> 2; // 0000 1111; 15, /4
    printf("a >> 2 : %d\n", c);

    // 2. 대입연산자(대입 + 산술 or 비트연산)
    /*
    =       
        -> a = 3
    +=, -=, *-, /=, %= 
        -> a += 1; a = a + 1 
    <<=, >>=, &=, ^=, |=
        -> a <<= 1; a = a << 1;
    */

    a = 21;
    c = '\0';
    c = a;      // 21
    c += a;     // 42; 21 + 21
    c -= a;     // 21; 21 - 21
    c /= a;     // 1; 21 / 21
    
    c = 200;
    c %= a;     // 11; 200 % 21
    c <<= 2;    // 44; 11 << 2
    c >>= 2;    // 11; 44 >> 2
    printf("%d\n", c);

    // 3. 기타연산자
    a = sizeof(a); // 변수크기
    printf("sizeof(a) : %d\n", a);
    int *A = &a;        // 참조자& (주소값)
    printf("%p\n", &a); //! p리터럴은 주소값 출력.
    printf("%d\n", *A); // 역참조* (주소의 실제값; 포인터)

    // 삼항연산자 (논리)? (참일때): (거짓일때)  
    a = 10;
    b = (a == 1) ? 20 : 30;
    printf("%d\n", b);

    return 0;
}