#include <stdio.h>

int main(void)
{
    //다차원 배열
    int i; // □
    int arr[5];
    // □□□□□ arr[0] ~ [4]
    int arr2[2][5];    //2차원
    // □□□□□ arr2[0][0] ~ [0][4]
    // □□□□□ arr2[1][0] ~ [1][4]
    int arr3[4][2];
    // □□ arr3[0][0] ~ [0][1]
    // □□
    // □□
    // □□ arr3[3][0] ~ [3][1]
    int arr4[3][3][3];    //3차원
    // [0][0][0], [0][0][1] , [0][0][2]
    // [0][1][0], ~
    // [0][2][0], ~
    //
    // [1][0][0] ~
    // [1][1][0] ~
    // [1][2][0] ~
    //
    // [2][0][0] ~ 이런식으로 이해
    int arr5[5] = { 1, 2, 3, 4, 5};  //1차원배열 입력
    int arr6[2][5] = { 
        {1, 2, 3, 4, 5}, 
        {1, 2, 3, 4, 5} 
    };
    int arr7[4][2] = { {1, 2}, {1, 2}, {1, 2}, {1, 2} };
    int arr8[3][3][3] = 
    { 
        { 
            {1, 2, 3}, 
            {1, 2, 3}, 
            {1, 2, 3}
        },
        { 
            {1, 2, 3}, 
            {1, 2, 3}, 
            {1, 2, 3}
        },
        {
            {1, 2, 3}, 
            {1, 2, 3}, 
            {1, 2, 3}
        }
    };
    
    puts("2차원배열 arr6");
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            printf("i:%d, j:%d, val=%d   ", i, j, arr6[i][j]);
        }
        printf("\n");
    };
    
    puts("3차원배열 arr8");
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            for(int k = 0; k < 3; k++)
            {
                printf("i:%d j:%d k:%d val= %d   ", i, j, k, arr8[i][j][k]);
            }
            printf("\n");
        }
        printf("\n");
    }


    
    return 0;
}
